var templeMap = {};
// 寺名: 地址 @经度,纬度     其中 @前加?表示仅到城市的模糊地址
`上海法忍寺: 上海金山区朱泾镇法忍寺 @121.158279,30.88455
华亭吴江边:  上海金山区朱泾镇华亭吴江边 @121.158279,30.88455
房山万佛堂:  北京房山区万佛堂 @115.987688,39.790381
北京普照寺:  北京海淀区北安河乡普照寺 @116.106873,40.055794
北京大觉寺:  北京海淀区西山大觉寺 @116.106728,40.052887
北京宗镜:   北京海淀区香山宗镜昭庙 @116.188648,39.99131
北京延寿寺:  北京昌平区延寿镇延寿寺 @116.326439,40.376987
北京庆寿寺:  北京西长安街庆寿寺(双塔寺) @116.381714,39.906734
北京栖隐寺:  北京门头沟仰山栖隐寺 @116.049797,40.041176
北京潭柘寺:  北京门头沟潭柘寺 @116.029732,39.90205
北京柳巷:   北京柳巷 @116.367233,39.938869
资州德纯寺:  四川内江资中宁国寺(资州德纯寺) @104.863823,29.802412
成都昭觉寺:  四川成都北郊昭觉寺 @104.105957,30.70632
成都天成寺:  四川成都龙泉驿天成山石经寺(天成寺) @104.348083,30.502262
万峰太平寺:  四川成都武侯区太平寺 @104.020073,30.602861
成都圣寿寺:  四川成都空慧寺(圣寿寺) @103.899132,30.43404
成都净众寺:  四川成都西门净众寺 @104.10194,30.65984
成都保唐寺:  四川成都保唐寺 @104.10194,30.65984
成都宝光寺:  四川成都新都区宝光寺 @104.160782,30.832022
成都大慈寺:  四川成都锦江区大慈寺 @104.083832,30.654408
青城山香林院: 四川成都青城山香林院 @103.606552,30.892286
普州东林寺:  四川资阳安岳县东林寺 @105.175392,29.916111
白云海会寺:  安徽安庆太湖县白云山海会寺 @116.349653,30.51649
太湖龙门寺:  安徽安庆太湖县龙门寺 @116.202461,30.413721
司空山二祖寺: 安徽安庆岳西县司空山二祖寺(无相寺) @115.987274,30.731283
天柱山三祖寺: 安徽安庆潜山县天柱山三祖寺(山谷寺) @116.494856,30.664817
潜山太平寺:  安徽安庆潜山县太平寺 @116.116669,30.248528
宣城景德寺:  安徽宣城城区景德寺 @118.760386,30.95068
宛陵开元寺:  安徽宣城陵阳开元寺 @118.760361,30.950792
无为铁佛寺:  安徽合肥无为铁佛寺(明教寺) @117.2961095,31.8647429
浮山会圣寺:  安徽枞阳浮山会圣寺 @117.287071,30.926052
浮山华严寺:  安徽枞阳浮山华严寺 @117.22019,30.69961
桐城投子寺:  安徽桐城投子山胜因院(投子寺) @116.957314,31.078411
泗县普照寺:  安徽泗县普照寺 @117.91106,33.48289
安徽琅琊寺:  安徽滁州琅琊寺 @118.28109,32.273762
铜陵南泉寺:  安徽铜陵南泉寺 @117.262024,30.426531
长清灵岩寺:  山东济南长清区灵岩寺 @116.983734,36.361641
淄博普照寺:  山东淄博普照寺 @117.961906,36.637363
沂州芙蓉湖:  山东沂州芙蓉湖 ?@118.62782,35.79034
五台山:      山西忻州五台山 @113.631935,38.94873
五台山华严寺: 山西忻州五台县南郊华严寺 @113.264191,38.730942
五台山金刚窟: 山西忻州五台县台怀镇金刚窟(般若寺) @113.602577,39.025612
五台山清凉寺: 山西忻州五台山清凉寺 @113.5005457,38.9685296
王山圆明禅院: 山西太原交城县王山圆明寺 @112.18792,37.571712
汾阳太子院:  山西汾阳太子院(天宁寺) @111.150284,37.525051
宋村永兴寺:  山西运城垣曲县宋村永兴寺(重兴寺) @111.830284,35.17432
蒲州麻谷山:  山西运城永济县蒲州镇麻谷山 @110.401806,34.799914
潮州灵山寺:  广东汕头潮阳区灵山寺(灵山护国禅寺) @116.440819,23.321932
韶关正觉寺:  广东韶关乳源县东平山正觉寺 @113.135666,24.683292
韶关云门寺:  广东韶关乳源县云门寺(大觉禅寺) @113.312995,24.806025
韶州大梵寺:  广东韶关兴隆街大鉴禅寺(大梵寺) @113.599196,24.800155
曹溪南华寺:  广东韶关曹溪南华寺(宝林寺) @113.636299,24.64533
南京长芦寺:  江苏南京六合区长芦寺 @118.810371,32.261982
南京保宁寺:  江苏南京凤凰台保宁寺 @118.628639,32.056042
南京栖霞寺:  江苏南京栖霞区摄山栖霞寺 @118.9584456,32.1518462
南京建初寺:  江苏南京秦淮区建初寺 @118.78212,32.006779
南京幽栖寺:  江苏南京江宁区祖堂山(牛头山)幽栖寺 @118.747788,31.89317
南京栖玄寺:  江苏南京玄武区鸡笼山栖玄寺(鸡鸣寺) @118.795768,32.060146
南京白马寺:  江苏南京浦口区?白马寺 ?@118.628212,32.076408
南京蒋山寺:  江苏南京玄武区蒋山寺(开善寺、太平兴国寺、灵谷寺) @118.867897,32.054958
南京天界寺:  江苏南京雨花台区天界寺 @118.775558,32.003471
南京清凉寺:  江苏南京鼓楼区清凉寺 @118.761681,32.04863
南京延祚寺:  江苏南京鼓楼区螺丝转弯(延祚寺，罗寺) @118.784134,32.041805
南京高峰寺:  江苏南京高峰寺 ?@118.909927,32.035255
磬山崇恩寺:  江苏宜兴磬山崇恩寺 @119.739563,31.184576
龙池禹门禅院: 江苏宜兴龙池山禹门禅院(澄光禅寺) @119.699104,31.21603
常州天宁寺:  江苏常州天宁寺(红梅阁西侧) @119.969786,31.774547
扬州高旻寺:  江苏扬州瓜洲镇高旻寺 @119.416618,32.323334
苏州万寿寺:  江苏苏州万寿山报恩光孝寺 @120.50396,31.01757
苏州狮子林:  江苏苏州城区狮子林寺园 @120.62889,31.3212067
苏州白云寺:  江苏苏州天平山白云寺 @120.629906,31.214006
苏州瑞光寺:  江苏苏州姑苏区瑞光寺 @120.615944,31.289341
苏州开元寺:  江苏苏州东大街开元寺(通玄寺) @120.617607,31.293058
苏州澄照寺:  江苏苏州虎丘区澄照寺(白鹤寺) @120.5107956,31.3161475
苏州灵岩寺:  江苏苏州木渎镇灵岩山寺 @120.501366,31.262447
虎丘云岩寺:  江苏苏州虎丘山云岩寺 @120.580406,31.335798
邓蔚圣恩寺:  江苏苏州邓尉山(天寿)圣恩寺 @120.386612,31.27359
三峰清凉寺:  江苏苏州常熟虞山三峰清凉寺(三峰寺) @120.7074746,31.6763047
镇江鹤林寺:  江苏镇江南山鹤林寺 @119.451462,32.190323
镇江茅山:   江苏镇江句容市茅山 @119.229927,31.902861
焦山定慧寺:  江苏镇江焦山定慧寺(普济寺、焦山寺) @119.484154,32.236671
镇江金山寺:  江苏镇江西北金山寺 @119.416077,32.21526
上饶博山寺:  江西上饶广丰区博山寺(能仁寺) @118.078819,28.418781
饶州永福寺:  江西上饶鄱阳永福寺 @117.765205,28.208805
饶州荐福寺:  江西上饶鄱阳荐福寺 @116.696335,28.992195
修水云岩寺:  江西九江修水县云岩寺 @114.575493,29.027302
修水兜率寺:  江西九江修水县兜率寺 @114.221924,29.019873
修水黄龙寺:  江西九江修水县黄龙崇恩寺 @114.010651,29.036701
庐山东林寺:  江西九江庐山东林寺 @115.949165,29.598227
庐山大林寺:  江西九江庐山大林寺 @115.712082,29.346251
庐山圆通寺:  江西九江庐山圆通寺(太平寺) @116.014633,29.525801
庐山开先寺:  江西九江庐山开先寺(秀峰寺) @115.9843787,29.47359
庐山归宗寺:  江西九江庐山归宗寺 @115.954094,29.435135
庐山铁佛寺:  江西九江庐山铁佛寺 @115.985987,29.601897
云居真如寺:  江西九江永修县云居山真如寺 @115.57946,29.09355
永修同安寺:  江西九江永修县凤栖山同安寺 @115.672447,29.131603
九江能仁寺:  江西九江浔阳区能仁寺(承天院) @115.995583,29.722261
洪州开元寺:  江西南昌东湖区佑民寺(开元寺) @115.89688,28.6822577
南昌翠岩寺:  江西南昌新建区翠岩寺 @115.73056,28.72716
南昌天宁寺:  江西南昌新建区天宁寺 @115.7370083,28.6844535
吉安宝安寺:  江西吉安金川镇耽源山保安寺 @115.405922,27.653893
吉安净居寺:  江西吉安青原山净居寺 @115.053196,27.057219
洞山普利寺:  江西宜春宜丰县同安乡洞山普利寺 @114.8704868,28.536387
宜丰黄檗寺:  江西宜春宜丰县黄檗寺 @114.450317,28.440321
末山九峰寺:  江西宜春上高县末山九峰寺 @114.676552,28.151581
仰山栖隐寺:  江西宜春袁州区仰山栖隐寺 @114.354233,27.628321
南泉慈化寺:  江西宜春南泉山慈化寺 @114.0325363,27.9993557
奉新百丈寺:  江西宜春奉新县百丈寺 @114.798875,28.69482
靖安宝峰寺:  江西宜春靖安县宝峰寺(泐潭寺) @115.4131476,29.0019047
高安大愚寺:  江西宜春高安市大愚寺 @115.3560158,28.4145874
南城宝方寺:  江西抚州南城县宝方寺 @116.905212,27.369112
曹山宝积寺:  江西抚州城南曹山宝积寺 @116.114018,27.5590116
黎川寿昌寺:  江西抚州黎川县寿昌寺 @117.02411,27.40806
黎川廪山寺:  江西抚州黎川县廪山寺 ?@116.90753,27.28236
黎川福山寺:  江西抚州黎川县福山古寺(双林寺) @116.942642,27.143841
杨岐普通寺:  江西萍乡上栗县杨岐山普通寺 @113.890263,27.830252
龚公山宝华寺: 江西赣县区龚公山宝华寺 @115.230988,26.2213
正定临济院:  河北石家庄正定县临济寺 @114.573044,38.13533
石家庄三圣寺: 河北石家庄桥西区三圣古寺 @114.432724,38.000015
赵州观音院:  河北赵县柏林寺(赵州观音院) @114.78387,37.749312
邢台天宁寺:  河北邢台桥东区天宁寺 @114.5009,37.073334
邢州净土寺:  河北邢台襄都区净土寺 @114.546608,37.05901
邢台开元寺:  河北邢台襄都区开元寺 @114.513237,37.072861
大名兴化寺:  河北邯郸大名兴化寺 @115.185043,36.310143
磁州大明寺:  河北邯郸磁州永年大明寺 @114.592628,36.772415
南阳丹霞山:  河南南阳南召县丹霞寺 @112.559395,33.511087
南阳香严寺:  河南南阳淅川县香严寺(显通禅寺) @111.440552,32.779091
平顶香山寺:  河南平顶山香山寺(观音祖庭) @113.193321,33.815994
开封净因寺:  河南开封净因寺 ?@114.34816,34.78861
开封慧林禅院: 河南开封大相国寺慧林禅院 @114.354553,34.791271
开封智海禅院: 河南开封大相国寺智海禅院 @114.354553,34.791271
开封天宁寺:  河南开封天宁寺(万寿寺) @113.940041,34.372589
开封法云寺:  河南开封法云寺 @114.3362796,34.7630886
开封华严寺:  河南开封通许县华严寺(大相国寺下院) @114.6082,34.507167
汝州广教寺:  河南汝州叶县广教寺 @113.360924,33.631634
汝州宝应寺:  河南汝州宝应寺(南院,南禅寺) @112.838364,34.14994
汝州广慧寺:  河南汝州广慧寺(东院) @112.857674,34.157341
汝州风穴寺:  河南汝州风穴寺(北院,白云寺) @112.897,34.22666
西京万寿寺:  河南洛阳伊川县万寿寺 @112.446388,34.481255
伏牛云岩寺:  河南洛阳嵩县伏牛山云岩寺 @111.998413,33.645771
洛阳白马寺:  河南洛阳白马寺 @112.605492,34.72184
龙门宝应寺:  河南洛阳龙门山宝应寺 @112.416,34.6661
龙门菩提寺:  河南洛阳龙门山菩提寺 @112.466667,34.558071
洛阳菏泽寺:  河南洛阳龙门菏泽寺(宝应寺) @112.416,34.6661
嵩山会善寺:  河南登封嵩山南麓会善寺 @113.004967,34.491482
嵩山嵩岳寺:  河南登封嵩山南麓嵩岳寺(闲居寺) @113.02224,34.49966
嵩山少林寺:  河南登封嵩山少室山少林寺 @112.953514,34.514709
南阳龙兴寺:  河南南阳宛城区龙兴寺 @112.597191,32.855404
少林永化堂:  河南登封嵩山少林寺南院永化堂 @112.93116,34.466225
首山乾明寺:  河南许昌襄城县首山乾明寺 @113.475513,33.824668
商城法眼寺:  河南信阳商城县黄檗山法眼寺 @115.32002,31.394104
天目禅源寺:  浙江临安西天目山南麓禅源寺 @119.4477066,30.3212595
天目狮子寺:  浙江临安西天目山师子院(狮子寺) @119.448586,30.323353
白云福林寺:  浙江丽水白云山福林寺(白云寺) @119.908257,28.490774
义乌圣寿寺:  浙江义乌伏龙山圣寿寺 @119.9694,29.29758
金华普济寺:  浙江义乌普济禅寺 @120.163414,29.508503
天台通玄寺:  浙江台州天台县石梁镇通玄寺 @121.029262,29.255673
天台华顶寺:  浙江台州天台山华顶寺(华顶讲寺) @121.095062,29.24991
天台国清寺:  浙江台州天台山国清寺(天台寺) @121.0473336,29.1702818
天台佛窟庵:  浙江台州天台县翠屏岩佛窟庵 @120.850549,29.0600247
天台般若寺:  浙江台州天台山般若寺(护国寺) @120.971764,29.226301
瑞岩净土寺:  浙江台州黄岩区瑞岩山净土禅寺(台州瑞岩寺) @121.09285,28.665051
嘉兴东塔寺:  浙江嘉兴东塔寺 @120.775352,30.761662
嘉兴福严寺:  浙江嘉兴桐乡市石门县福严寺 @120.4467445,30.5877459
天宁永祚寺:  浙江嘉兴海盐县天宁永祚寺(海盐天宁寺) @120.937764,30.517423
盐官海昌院:  浙江嘉兴海宁盐官镇海昌院 @120.700279,30.540201
嘉善大云寺:  浙江嘉兴嘉善县大云寺 @120.9508676,30.775383
嘉兴资圣寺:  浙江嘉兴资圣院(水西寺) @120.851685,30.668261
雪窦资圣寺:  浙江奉化溪口雪窦山资圣寺 @121.221085,29.683411
四明育王寺:  浙江宁波四明山阿育王寺 @121.764405,29.840182
四明大梅山:  浙江宁波鄞州区大梅山 @121.59993,29.72345
宁波天童寺:  浙江宁波太白山麓天童寺 @121.795039,29.803728
宁波天宁寺:  浙江宁波海曙区天宁寺 @121.543304,29.874142
宁波智门寺:  浙江宁波象山智门寺 @121.757767,29.475761
杭州报国寺:  浙江杭州上城区万松岭报国寺 @120.160896,30.225548
杭州中天竺寺: 浙江杭州中天竺寺(法净禅寺) @120.10201,30.233738
杭州理安寺:  浙江杭州九溪理安寺(法雨寺) @120.112993,30.207219
杭州东明寺:  浙江杭州余杭区安溪东明寺 @119.994606,30.435385
杭州径山寺:  浙江杭州余杭区径山寺(兴圣万寿寺) @119.765167,30.379801
睦州龙兴寺:  浙江杭州余杭区龙兴寺 @120.31911,30.408692
睦州开元寺:  浙江杭州建德梅城开元寺 @119.492324,29.53703
杭州圣因寺:  浙江杭州拱墅区圣因寺 @120.148209,30.290491
灵隐无箸院:  浙江杭州灵隐山无箸院 @120.10601,30.239592
杭州净慈寺:  浙江杭州西湖区净慈寺 @120.14932,30.228914
杭州灵隐寺:  浙江杭州西湖区灵隐寺 @120.101379,30.240852
护国仁王寺:  浙江杭州西湖区曙光路护国仁王寺 @120.139084,30.264631
西湖秦望山:  浙江杭州西湖秦望山 @119.944733,30.040743
杭州天龙寺:  浙江杭州玉皇山南麓天龙寺 @120.1479587,30.2113647
杭州龙册寺:  浙江杭州龙册寺 @120.21201,30.2084
杭州圆照寺:  浙江杭州圆照寺 @120.334702,30.370132
温州灵岩寺:  浙江温州乐清雁荡山灵岩寺 @121.087791,28.361452
温州能仁寺:  浙江温州乐清雁荡山能仁寺 @121.062828,28.337982
温州龙兴寺:  浙江温州鹿城区松台山龙兴寺 @120.513168,28.06353
温州江心寺:  浙江温州鹿城区江心寺 @120.647453,28.026854
德清高峰寺:  浙江湖州德清县莫干山高峰寺 @119.929031,30.586981
湖州幻住庵:  浙江湖州弁山大道幻住寺(幻住普宁寺,幻住禅庵) @120.076019,30.934702
湖州报恩寺:  浙江湖州弁山报恩寺 @120.036079,30.901052
绍兴云门寺:  浙江绍兴柯桥区平水云门寺(显圣寺) @120.601808,29.874443
绍兴天衣寺:  浙江绍兴秦望山天衣寺(法华寺) @120.56694,29.892254
越州镜清寺:  浙江绍兴仓桥直街镜清寺 @120.577562,30.000994
普陀普济寺:  浙江舟山普陀山普济寺(宝陀寺) @122.387047,29.984856
杭州崇福寺:  浙江萧山区崇福寺(杨岐寺) @120.197495,30.100624
崇阳灌溪寺:  湖北咸宁崇阳县寺前村灌溪寺 @113.977113,29.541632
当阳玉泉寺:  湖北当阳玉泉寺 @111.686704,30.787424
武汉归元寺:  湖北武汉汉阳区归元寺 @114.260933,30.545921
汉阳大别寺:  湖北武汉汉阳龟山大别寺(文殊院,太平兴国寺) @114.26786,30.554331
荆州天皇寺:  湖北荆州荆江大堤北侧天皇寺(天王寺) @112.198692,30.326582
襄阳洞山寺:  湖北襄阳谷城县洞山寺 @111.572739,32.259331
襄阳延庆寺:  湖北襄阳延庆寺 @112.156103,31.998481
襄阳谷隐寺:  湖北襄阳襄城区谷隐寺 @112.156654,31.976892
襄阳鹿门寺:  湖北襄阳襄州区鹿门寺 @112.26683,31.910122
襄州关南寺:  湖北襄阳关南寺 ?@112.21194,32.08718
郢州大阳山寺: 湖北武汉黄陂区大阳山寺 @114.442528,30.977703
随州大洪山:  湖北随州大洪山慈恩寺 @112.983269,31.48597
随州智门寺:  湖北随州智门寺 @113.383588,31.730127
随州双泉山:  湖北随州新港双泉山 @113.421089,31.477001
随州龙泉寺:  湖北随州广水关子岭龙泉寺 @113.670616,31.462787
三祖天然寺:  湖北黄冈浠水县三祖天然寺 @115.245422,30.317532
蕲春三角寺:  湖北黄冈蕲春县三角寺(龙门资教寺) @115.561249,30.460112
黄梅五祖寺:  湖北黄冈黄梅县东山五祖寺(东山寺) @115.941353,30.184755
黄梅老祖寺:  湖北黄冈黄梅县慈云山老祖寺 @115.844429,30.227373
黄梅四祖寺:  湖北黄冈黄梅县西山四祖寺(双峰寺) @115.794565,30.121636
黄梅西禅寺:  湖北黄冈黄梅县西山永福禅寺 @115.83596,30.029388
龙湖芝佛院:  湖北黄冈麻城市龙湖芝佛院 @115.110571,31.20763
鄂州岩头:   湖北鄂州岩头 ?@114.89171,30.40057
德山乾明寺:  湖南常德德山乾明寺 @111.698799,28.970482
常德梁山:   湖南常德梁山(太阳山) @111.73877,29.173183
常德龙潭寺:  湖南常德澧县龙潭寺 @111.759613,29.644173
石门夹山寺:  湖南常德石门县夹山寺(灵泉禅院) @111.489258,29.561512
石门洛浦寺:  湖南常德石门县洛浦寺 @111.433418,29.663851
神鼎资圣寺:  湖南汨罗神鼎山资圣寺 @113.129233,28.684526
湖南药山寺:  湖南津市药山寺(慈云寺) @111.806824,29.322092
南岳云峰寺:  湖南衡阳衡山云峰寺 @112.772598,27.30718
南岳南台寺:  湖南衡阳衡山南台寺 @112.710339,27.259539
南岳磨镜台:  湖南衡阳衡山磨镜台 @112.70311,27.26725
南岳福严寺:  湖南衡阳衡山福严寺(般若寺) @112.703156,27.263297
沩山同庆寺:  湖南长沙宁乡市沩山同庆寺 @112.026672,28.163151
沩山密印寺:  湖南长沙宁乡市沩山密印寺 @111.9705476,28.177213
湖南大沩山:  湖南长沙大沩山 @111.968842,28.17305
长沙道林寺:  湖南长沙岳麓山道林寺(岳麓书院) @112.939812,28.180494
长沙开福寺:  湖南长沙开福寺(报慈寺) @112.978592,28.22431
望城华林寺:  湖南长沙望城区华林寺 @112.888008,28.496061
浏阳石霜寺:  湖南长沙浏阳石霜寺 @113.64764,27.906421
长沙龙兴寺:  湖南长沙浏阳龙兴寺 @113.502792,28.44647
东都洛阳:   河南洛阳 @112.51078,34.70431
京师长安:   陕西西安 @108.93425,34.23053
建阳佛迹岭:  福建南平建阳区佛迹岭圣迹寺 @117.959183,27.371061
福州灵岩寺:  福建福州晋安区升山灵岩寺(升山寺) @119.287087,26.1312027
福清黄檗寺:  福建福州福清市黄檗山万福寺 @119.257172,25.63994
福州西禅寺:  福建福州西郊怡山西禅寺(长庆寺) @119.277458,26.070652
福州雪峰寺:  福建福州闽候雪峰寺(崇圣寺) @119.044899,26.398172
鼓山涌泉寺:  福建福州鼓山涌泉寺(华严寺) @119.39537,26.055361
福州东禅寺:  福建福州东禅寺 @119.485069,26.384773
福州西禅寺:  福建福州西禅寺 @119.275988,26.071688
福州开元寺:  福建福州开元寺(大云寺) @119.30171,26.090664
福州法海寺:  福建福州罗山法海寺 @119.3056019,26.0801327
汀州开元寺:  福建龙岩长汀县汀州开元寺 @116.36262,25.83236
安吉山报国寺: 福建漳州云霄县安吉山报国寺 @117.240166,23.71488
支提山华严寺: 福建宁德县支提山华严寺(支提寺,华藏万寿寺) @119.387764,26.810503
松溪罗汉院:  福建松溪罗汉院 @118.8261257,27.562914
福州地藏寺:  福建福州地藏寺(法林寺) @119.319649,26.09234
东苑静室:   福建东苑静室 ?@119.300629,26.095371
梁平双桂堂:  重庆梁平区万竹山双桂堂 @107.706123,30.605463
长安少林寺:  长安(西安)少林寺 ?@108.94878,34.22259
终南翠微寺:  陕西西安长安区黄峪寺(终南山翠微寺) @108.807198,34.067039
终南圭峰寺:  陕西西安长安区圭峰寺 @108.76741,33.997738
终南草堂寺:  陕西西安鄠邑区草堂寺 @108.743935,34.013763
长安龙兴寺:  陕西安康汉滨区龙王山龙兴寺 @109.093785,32.7761598
安徽: @117.194778,31.86577
北京: @116.403694,39.949459
重庆: @106.553263,29.556681
福建: @119.292069,26.144144
甘肃: @103.856737,36.094212
广东: @113.239359,23.185545
广西: @108.345678,22.861984
贵州: @106.616332,26.707352
海南: @110.350983,19.968035
河北: @114.508772,38.083783
河南: @113.644099,34.769161
黑龙江: @126.522207,45.801617
湖北: @114.361594,30.601078
湖南: @112.926605,28.217167
吉林: @125.326383,43.797768
江苏: @118.832137,32.038322
江西: @115.851775,28.672488
辽宁: @123.486653,41.682522
内蒙: @111.785972,40.849642
宁夏: @106.257585,38.482579
青海: @101.851432,36.622494
山东: @117.194778,36.652148
山西: @112.595453,37.858034
陕西: @109.026378,34.350591
上海: @121.518142,31.211845
四川: @104.132697,30.561282
天津: @117.286764,39.001295
西藏: @91.144205,29.649484
新疆: @87.667116,43.817754
云南: @102.881681,24.866897
浙江: @120.211934,30.274265
香港: @114.242011,22.272474
澳门: @113.579709,22.169692
台湾: @121.591732,25.034634`
  .split('\n').map(s => s.split(/:\s*/)).filter(s => s.length > 1)
  .forEach(s => (templeMap[s[0]] = s[1]))

var templeRe = /\s*[?(-].+$/g
const personTemples = {}; // 人名: [地址, 经纬度]
// 人名: 寺名, 寺名(备注)    其中的 寺名 与templeMap对应
`菩提达摩: 嵩山少林寺
神光慧可: 司空山二祖寺
鉴智僧璨: 天柱山三祖寺
大医道信: 黄梅四祖寺, 黄梅西禅寺, 庐山大林寺
大满弘忍: 黄梅五祖寺
大鉴慧能: 韶州大梵寺, 曹溪南华寺
牛头法融: 南京建初寺, 南京幽栖寺, 镇江茅山
白马智岩: 天柱山三祖寺(从宝月禅师), 南京白马寺, 南京栖玄寺, 南京石头城疠人坊
牛头慧方: 南京幽栖寺, 镇江茅山
金陵法持: 南京延祚寺
幽栖智威: 南京幽栖寺, 南京延祚寺
鹤林玄素: 镇江鹤林寺
牛头慧忠: 南京幽栖寺, 南京延祚寺
径山道钦: 杭州径山寺
五台无著: 五台山华严寺, 五台山金刚窟
五台无名: 五台山
鸟窠道林: 西湖秦望山
佛窟惟则: 天台佛窟庵
嵩山道安: 嵩山会善寺
大通神秀: 当阳玉泉寺, 东都洛阳, 京师长安
南阳慧忠: 长安龙兴寺, 南阳香严寺
耽源应真: 吉安宝安寺
德纯智诜: 资州德纯寺
德纯处寂: 资州德纯寺
净众无相: 成都净众寺
保唐无住: 成都保唐寺
净众神会: 成都净众寺
破灶堕: 嵩山嵩岳寺
嵩山法如: 嵩山少林寺
嵩山元珪: 嵩山嵩岳寺
嵩山普寂: 嵩山会善寺
永嘉玄觉: 温州龙兴寺
菏泽神会: 南阳龙兴寺, 洛阳菏泽寺, 邢台开元寺
会善净藏: 嵩山会善寺
南岳怀让: 南岳福严寺
五台隐峰: 五台山清凉寺
大梅法常: 四明大梅山
麻谷宝彻: 蒲州麻谷山
盐官齐安: 盐官海昌院
青原行思: 吉安净居寺
石头希迁: 南岳南台寺
马祖道一: 南岳磨镜台, 建阳佛迹岭, 龚公山宝华寺, 洪州开元寺, 靖安宝峰寺
百丈怀海: 靖安宝峰寺(马祖塔隐修), 奉新百丈寺
伏牛自在: 伏牛云岩寺
华林善觉: 奉新百丈寺(首座), 望城华林寺
归宗智常: 庐山归宗寺
高安大愚: 高安大愚寺
末山了然: 末山九峰寺
南泉普愿: 铜陵南泉寺
赵州从谂: 赵州观音院
黄檗希运: 宜丰黄檗寺, 宛陵开元寺, 福清黄檗寺
沩山灵祐: 沩山密印寺, 沩山同庆寺
大颠宝通: 潮州灵山寺
药山惟俨: 湖南药山寺
荆南惟忠: 成都圣寿寺
天皇道悟: 荆州天皇寺
仰山慧寂: 仰山栖隐寺, 韶关正觉寺
西塔光穆: 仰山栖隐寺
资福如宝: 仰山栖隐寺
报慈德韶: 长沙开福寺
三角志谦: 蕲春三角寺
香严智闲: 南阳香严寺
径山洪諲: 杭州径山寺
睦州道明: 睦州开元寺, 睦州龙兴寺
三圣慧然: 石家庄三圣寺
临济义玄: 正定临济院, 大名兴化寺
兴化存奖: 大名兴化寺
南院慧顒: 汝州宝应寺
灌溪志闲: 崇阳灌溪寺
龙潭崇信: 常德龙潭寺
德山宣鉴: 德山乾明寺
雪峰义存: 福州雪峰寺
船子德诚: 华亭吴江边
夹山善会: 镇江鹤林寺, 石门夹山寺, 上海法忍寺
道吾圆智: 襄州关南寺
石霜庆诸: 浏阳石霜寺
大觉道虔: 末山九峰寺
洛浦元安: 石门洛浦寺
丹霞天然: 南阳丹霞山, 三祖天然寺, 襄阳鹿门寺
丹霞子淳: 南阳丹霞山, 随州大洪山
翠微无学: 终南翠微寺
投子大同: 桐城投子寺
云岩昙晟: 修水云岩寺
磁州智如: 磁州法观寺
遂州道圆: 遂州大云寺
圭峰宗密: 终南草堂寺, 终南圭峰寺
洞山良价: 洞山普利寺
休梦了觉: 成都昭觉寺
曹山本寂: 曹山宝积寺
云居道膺: 云居真如寺
鹿门处真: 襄阳鹿门寺
岩头全奯: 鄂州岩头, 洞庭卧龙山
罗山道闲: 福州法海寺
玄沙师备: 福州灵岩寺
罗汉桂琛: 福州地藏寺, 松溪罗汉院
法眼文益: 南京清凉寺
天台德韶: 天台般若寺, 天台通玄寺, 上饶博山寺
永明延寿: 杭州净慈寺, 杭州灵隐寺, 雪窦资圣寺
云门文偃: 韶关云门寺
风穴延沼: 汝州风穴寺,汝州广慧寺
首山省念: 首山乾明寺,汝州广教寺,汝州宝应寺
广慧元琏: 汝州广慧寺
汾阳善昭: 汾阳太子院
谷隐蕴聪: 襄阳谷隐寺
神鼎洪諲: 神鼎资圣寺
琅琊慧觉: 安徽琅琊寺
大愚守芝: 高安大愚寺
云峰文悦: 南岳云峰寺
黄龙慧南: 修水黄龙寺, 永修同安寺
常总照觉: 庐山东林寺
晦堂祖心: 修水黄龙寺
兜率从悦: 修水兜率寺
灵源惟清: 修水黄龙寺, 潜山太平寺
云庵真净: 庐山归宗寺,修水兜率寺
叶县归省: 汝州广教寺
石霜楚圆: 浏阳石霜寺, 南岳福严寺
杨岐方会: 杨岐普通寺
白云守端: 白云海会寺, 九江能仁寺, 庐山圆通寺
五祖法演: 白云海会寺, 黄梅五祖寺
开福道宁: 长沙开福寺
西堂智藏: 洪州开元寺, 龚公山宝华寺
圆悟克勤: 成都昭觉寺, 成都宝光寺, 镇江金山寺, 南京蒋山寺, 石门夹山寺, 开封天宁寺, 云居真如寺
双泉师宽: 随州双泉山
香林澄远: 青城山香林院
五祖师戒: 黄梅五祖寺
清凉泰钦: 南京清凉寺
云居道齐: 云居真如寺
灵隐文胜: 五台山, 灵隐无箸院
浮山法远: 浮山会圣寺, 浮山华严寺
汉月法藏: 三峰清凉寺
泐潭怀澄: 蕲春三角寺, 靖安宝峰寺
智门光祚: 随州智门寺
雪窦重显: 雪窦资圣寺
天衣义怀: 宣城景德寺, 无为铁佛寺, 绍兴天衣寺, 支提山华严寺
大觉怀琏: 开封净因寺, 四明育王寺
净因道臻: 开封净因寺
开元智孜: 汀州开元寺
慧林宗本: 苏州瑞光寺, 杭州净慈寺, 开封慧林禅院
法云法秀: 开封法云寺
佛印了元: 镇江金山寺, 云居真如寺
法云善本: 开封法云寺
妙湛思慧: 杭州灵隐寺, 杭州净慈寺, 开封智海禅院, 福州雪峰寺
圆通居讷: 庐山归宗寺, 庐山圆通寺
延庆子荣: 襄阳洞山寺, 襄阳延庆寺
同安道丕: 永修同安寺
同安观志: 永修同安寺
梁山缘观: 常德梁山
大阳警玄: 郢州大阳山寺
投子义青: 浮山华严寺, 桐城投子寺
太平慧勤: 开封智海禅院, 南京蒋山寺, 潜山太平寺
文殊心道: 邢台天宁寺, 汉阳大别寺
龙门清远: 太湖龙门寺
高庵善悟: 天台华顶寺, 云居真如寺
芙蓉道楷: 沂州芙蓉湖, 随州大洪山, 开封净因寺, 开封天宁寺
大洪报恩: 长安少林寺, 开封法云寺, 随州大洪山
净因自觉: 开封净因寺, 襄阳鹿门寺
虎丘绍隆: 虎丘云岩寺, 黎川福山寺, 云居真如寺
长芦崇信: 南京长芦寺, 嘉兴资圣寺
慧林怀深: 开封慧林禅院, 焦山定慧寺, 南京长芦寺, 南京蒋山寺
大洪祖证: 随州大洪山, 饶州荐福寺
广慧通理: 北京潭柘寺
中竺元妙: 杭州中天竺寺
净因惟岳: 开封净因寺, 开封华严寺
高庵善悟: 云居真如寺
云居法如: 云居真如寺
龙翔士珪: 温州能仁寺
枯木法成: 平顶香山寺, 焦山定慧寺, 开封净因寺
大慧宗杲: 杭州径山寺
宏智正觉: 南京长芦寺, 宁波天童寺, 泗县普照寺
真歇清了: 南京长芦寺, 福州雪峰寺, 杭州径山寺, 温州江心寺, 普陀普济寺
青州希辨: 北京潭柘寺, 淄博普照寺
大休宗钰: 宁波天童寺
净慈慧晖: 雪窦资圣寺, 杭州净慈寺
普庵印肃: 南泉慈化寺
雪窦智鉴: 雪窦资圣寺
大明僧宝: 长清灵岩寺, 北京栖隐寺, 磁州大明寺
玉林师体: 王山圆明禅院
拙庵德光: 杭州径山寺, 杭州灵隐寺, 四明育王寺
灵隐道济: 杭州灵隐寺, 杭州净慈寺
灵隐慧光: 杭州灵隐寺
雪岩慧满: 磁州大明寺
胜默圆光: 北京庆寿寺
无用净全: 宁波天童寺
海云印简: 正定临济院(金朝镇州), 北京庆寿寺, 北京潭柘寺
月林师观: 苏州万寿寺
竹岩妙印: 浏阳石霜寺
应庵昙华: 庐山归宗寺, 宁波天童寺, 南京蒋山寺
密庵咸杰: 宁波天童寺, 杭州灵隐寺
破庵祖先: 杭州灵隐寺
松源崇岳: 苏州澄照寺, 饶州荐福寺, 虎丘云岩寺, 杭州灵隐寺
灵隐之善: 杭州灵隐寺
高峰原妙: 天目狮子寺, 德清高峰寺
天童如净: 南京清凉寺, 杭州径山寺, 杭州净慈寺, 瑞岩净土寺, 宁波天童寺
永平道元: 日本曹洞宗永平寺
万松行秀: 邢州净土寺, 北京潭柘寺, 北京庆寿寺, 北京栖隐寺
雪庭福裕: 北京潭柘寺, 嵩山少林寺
少室文泰: 嵩山少林寺
还源福遇: 嵩山少林寺, 洛阳白马寺, 龙门宝应寺
淳拙文才: 嵩山少林寺
松庭子俨: 嵩山少林寺
凝然了改: 嵩山少林寺
俱空契斌: 宋村永兴寺, 嵩山少林寺, 西京万寿寺
无方可从: 龙门菩提寺, 嵩山少林寺
月舟文载: 嵩山少林寺
小山宗书: 嵩山少林寺, 北京宗镜
幻休常润: 嵩山少林寺, 西京万寿寺
无言正道: 嵩山少林寺, 少林永化堂
东谷妙光: 杭州灵隐寺
天目文礼: 杭州净慈寺, 宁波天童寺
无准师范: 杭州径山寺
断桥妙伦: 杭州净慈寺, 瑞岩净土寺, 天台国清寺
方山文宝: 杭州径山寺, 瑞岩净土寺
云外云岫: 宁波智门寺, 宁波天宁寺, 宁波天童寺
直翁德举: 宁波天童寺
无印大证: 雪窦资圣寺
雪窦嗣宗: 雪窦资圣寺
主峰德昆: 武汉归元寺
大晓实彻: 常州天宁寺
铁舟行海: 镇江金山寺
天慧实彻: 扬州高旻寺, 磬山崇恩寺, 杭州崇福寺
了凡际圣: 扬州高旻寺
箬庵通问: 杭州理安寺, 镇江金山寺
玉林通琇: 湖州报恩寺, 天目禅源寺
䒢溪行森: 湖州报恩寺, 杭州崇福寺, 黄梅老祖寺
行山超宝: 杭州圆照寺, 天目狮子寺
楚云明慧: 杭州圣因寺
横川如珙: 温州灵岩寺, 温州能仁寺, 四明育王寺
雪岩祖钦: 长沙龙兴寺, 长沙道林寺, 仰山栖隐寺
断崖了义: 天目狮子寺
天如惟则: 苏州狮子林
中峰明本: 天目狮子寺, 湖州幻住庵
无见先睹: 天台华顶寺
白云空度: 白云福林寺, 天台华顶寺
古拙原俊: 南京天界寺
古林清茂: 南京保宁寺, 苏州白云寺, 苏州开元寺, 饶州永福寺
元叟行端: 杭州径山寺
楚石梵琦: 天宁永祚寺
天宁道济: 天宁永祚寺
云谷法会: 南京栖霞寺
牧庵法忠: 修水黄龙寺
大沩善果: 福清黄檗寺, 福州东禅寺, 福州西禅寺, 湖南大沩山
镜清道怤: 越州镜清寺, 杭州天龙寺, 杭州龙册寺
千岩元长: 义乌圣寿寺
万峰时蔚: 邓蔚圣恩寺
宝藏普持: 邓蔚圣恩寺
东明慧旵: 杭州东明寺
海舟普慈: 杭州东明寺
宝峰明瑄: 杭州东明寺, 南京高峰寺
海舟永慈: 杭州东明寺
宝峰智瑄: 杭州东明寺
天奇本瑞: 南京高峰寺
无闻明聪: 随州龙泉寺
无际明悟: 普州东林寺
楚山绍琦: 成都天成寺, 桐城投子寺
朗目本智: 浮山华严寺
笑岩德宝: 北京柳巷
蕴空常忠: 黎川廪山寺
无明慧经: 南城宝方寺, 黎川寿昌寺
慈舟方念: 云居真如寺, 北京大觉寺, 五台山
幻有正传: 龙池禹门禅院, 北京普照寺
雪峤圆信: 杭州径山寺, 庐山开先寺, 绍兴云门寺, 嘉兴东塔寺
密云圆悟: 宁波天童寺, 福清黄檗寺, 天台通玄寺
天隐圆修: 磬山崇恩寺
洪断诸缘: 云居真如寺, 房山万佛堂
湛然圆澄: 绍兴云门寺, 杭州径山寺, 杭州报国寺
无异元来: 上饶博山寺, 南京天界寺, 鼓山涌泉寺
永觉元贤: 鼓山涌泉寺
为霖道霈: 鼓山涌泉寺
觉浪道盛: 南京天界寺, 杭州径山寺
晦台元镜: 东苑静室
林野通奇: 天台通玄寺, 宁波天童寺
破山海明: 万峰太平寺, 梁平双桂堂
费隐通容: 杭州径山寺, 福清黄檗寺, 嘉兴福严寺
隐元隆琦: 福清黄檗寺, 日本京都黄檗山万福寺
宗宝道独: 庐山归宗寺, 福州西禅寺
瑞白明雪: 奉新百丈寺
破暗净灯: 焦山定慧寺
古樵智先: 焦山定慧寺
德俊自觉: 焦山定慧寺
无门慧开: 苏州开元寺, 苏州灵岩寺, 安吉山报国寺, 焦山定慧寺, 南京保宁寺, 护国仁王寺, 南昌天宁寺, 南昌翠岩寺
瞎堂慧远: 金华普济寺, 杭州灵隐寺
大迁圆慧: 支提山华严寺, 北京延寿寺, 福州灵岩寺
大安明启: 支提山华严寺, 福州开元寺
无念深有: 宜丰黄檗寺, 龙湖芝佛院, 商城法眼寺
`.split('\n').map(s => s.split(/[:,]\s*/g))
  .forEach(s => s[1] && (personTemples[s[0]] = s.slice(1)))

// {id, name, born, dead, age, parent, alias, temples, templesFull, coordinates}
// 每行为 name, born, dead, age, parent, [alias]
var patriarchs = [
  ['菩提达摩', 0, 536, 0, '#'],
  ['神光慧可', 487, 593, 107, '菩提达摩'],
  ['鉴智僧璨', 510, 606, 97, '神光慧可'],
  ['白马智岩', 577, 654, 78, '牛头法融', ['中郎将']],
  ['大医道信', 580, 651, 72, '鉴智僧璨'],
  ['嵩山道安', 581, 708, 128, '大满弘忍', ['慧安', '国师']],
  ['破灶堕', 0, 0, 0, '嵩山道安'],
  ['牛头法融', 594, 657, 64, '大医道信', ['牛头宗']],
  ['大满弘忍', 601, 674, 74, '大医道信'],
  ['大通神秀', 606, 706, 101, '大满弘忍', ['北宗', '两京法主']],
  ['德纯智诜', 609, 702, 94, '大满弘忍', ['四川禅系']],
  ['牛头慧方', 629, 695, 67, '白马智岩'],
  ['金陵法持', 635, 702, 68, '牛头慧方'],
  ['嵩山法如', 638, 689, 52, '大满弘忍'],
  ['大鉴慧能', 638, 713, 76, '大满弘忍'],
  ['嵩山元珪', 644, 716, 73, '嵩山法如'],
  ['幽栖智威', 646, 722, 77, '金陵法持'],
  ['德纯处寂', 648, 734, 87, '德纯智诜'],
  ['嵩山普寂', 651, 739, 89, '大通神秀'],
  ['永嘉玄觉', 665, 713, 49, '大鉴慧能'],
  ['鹤林玄素', 668, 752, 85, '幽栖智威'],
  ['菏泽神会', 668, 760, 93, '大鉴慧能', ['菏泽宗']],
  ['青原行思', 670, 740, 71, '大鉴慧能'],
  ['会善净藏', 674, 746, 73, '大鉴慧能'],
  ['南阳慧忠', 675, 775, 101, '大鉴慧能', ['国师']],
  ['耽源应真', 0, 0, 0, '南阳慧忠'],
  ['南岳怀让', 677, 744, 68, '大鉴慧能', ['大慧']],
  ['牛头慧忠', 682, 769, 88, '幽栖智威'],
  ['五台无著', 682, 769, 88, '牛头慧忠'],
  ['净众无相', 684, 762, 79, '德纯处寂', ['净众宗']],
  ['石头希迁', 700, 790, 91, '青原行思'],
  ['荆南惟忠', 705, 782, 78, '磁州智如', ['益州南印']],
  ['马祖道一', 709, 788, 80, '南岳怀让', ['大寂', '洪州宗']],
  ['华林善觉', 0, 0, 0, '马祖道一', ['华林二虎']],
  ['五台隐峰', 0, 0, 0, '马祖道一'],
  ['大梅法常', 752, 839, 78, '马祖道一'],
  ['麻谷宝彻', 0, 0, 0, '马祖道一'],
  ['盐官齐安', 0, 842, 0, '马祖道一', ['国师']],
  ['径山道钦', 714, 792, 79, '鹤林玄素', ['国一', '法钦']],
  ['保唐无住', 714, 774, 61, '净众无相', ['保唐宗']],
  ['净众神会', 720, 794, 75, '净众无相'],
  ['百丈怀海', 720, 814, 95, '马祖道一', ['大智']],
  ['五台无名', 722, 794, 73, '菏泽神会'],
  ['大颠宝通', 732, 824, 93, '石头希迁'],
  ['药山惟俨', 737, 834, 98, '石头希迁'],
  ['西堂智藏', 738, 817, 80, '马祖道一'],
  ['华严澄观', 738, 839, 102, '五台无名'],
  ['丹霞天然', 739, 824, 86, '石头希迁'],
  ['鸟窠道林', 741, 824, 84, '径山道钦'],
  ['佛窟惟则', 746, 830, 85, '牛头慧忠'],
  ['天皇道悟', 748, 807, 60, '石头希迁'],
  ['南泉普愿', 748, 834, 87, '马祖道一'],
  ['磁州智如', 749, 834, 86, '菏泽神会'],
  ['黄檗希运', 755, 850, 96, '百丈怀海', ['断际']],
  ['伏牛自在', 755, 817, 63, '马祖道一'],
  ['船子德诚', 766, 836, 71, '药山惟俨'],
  ['道吾圆智', 769, 836, 68, '药山惟俨', ['道吾宗智', '智头陀']],
  ['龙潭崇信', 770, 840, 71, '天皇道悟'],
  ['沩山灵祐', 771, 853, 83, '百丈怀海', ['沩仰宗']],
  ['归宗智常', '<768', 820, 0, '马祖道一'],
  ['高安大愚', '<805', 835, 0, '归宗智常'],
  ['末山了然', 0, 0, 0, '高安大愚'],
  ['赵州从谂', 778, 897, 120, '南泉普愿'],
  ['遂州道圆', '<760', '>807', 0, '荆南惟忠'],
  ['圭峰宗密', 780, 841, 62, '遂州道圆', ['华严禅']],
  ['睦州道明', 780, 877, 98, '黄檗希运', ['陈尊宿']],
  ['云岩昙晟', 781, 841, 61, '药山惟俨'],
  ['德山宣鉴', 782, 865, 84, '龙潭崇信'],
  ['临济义玄', 787, 867, 81, '黄檗希运', ['临济宗']],
  ['裴休居士', 791, 864, 74, '黄檗希运'],
  ['夹山善会', 805, 881, 77, '船子德诚'],
  ['石霜庆诸', 807, 888, 82, '道吾圆智'],
  ['大觉道虔', 0, 0, 0, '石霜庆诸'],
  ['洞山良价', 807, 869, 63, '云岩昙晟', ['曹洞宗']],
  ['休梦了觉', 0, '>885', 0, '洞山良价'],
  ['香严智闲', 810, 898, 89, '沩山灵祐'],
  ['三圣慧然', '<850', 870, 0, '临济义玄'],
  ['翠微无学', '<804', '>830', 0, '丹霞天然'],
  ['投子大同', 819, 914, 96, '翠微无学'],
  ['雪峰义存', 822, 908, 87, '德山宣鉴'],
  ['岩头全奯', 826, 885, 60, '德山宣鉴'],
  ['径山洪諲', 828, 901, 74, '沩山灵祐'],
  ['兴化存奖', 830, 888, 59, '临济义玄'],
  ['玄沙师备', 835, 908, 74, '雪峰义存'],
  ['灌溪志闲', '<847', 895, 0, '临济义玄'],
  ['曹山本寂', 840, 901, 62, '洞山良价'],
  ['鹿门处真', 0, 0, '>810', '曹山本寂'],
  ['仰山慧寂', 807, 883, 77, '沩山灵祐'],
  ['洛浦元安', 843, 898, 56, '夹山善会'],
  ['云居道膺', 848, 902, 55, '洞山良价'],
  ['西塔光穆', 852, 940, 89, '仰山慧寂'],
  ['南院慧顒', 860, 952, 93, '兴化存奖'],
  ['云门文偃', 864, 949, 86, '雪峰义存', ['云门宗']],
  ['罗汉桂琛', 867, 928, 62, '玄沙师备', ['地藏桂琛']],
  ['镜清道怤', 868, 937, 70, '雪峰义存'],
  ['法眼文益', 885, 958, 74, '罗汉桂琛', ['法眼宗']],
  ['罗山道闲', 887, 928, 42, '岩头全奯'],
  ['双泉师宽', 890, 955, 66, '云门文偃'],
  ['资福如宝', 890, 960, 71, '西塔光穆'],
  ['天台德韶', 891, 972, 82, '法眼文益'],
  ['风穴延沼', 896, 973, 78, '南院慧顒'],
  ['同安道丕', 898, 955, 58, '云居道膺'],
  ['永明延寿', 905, 975, 71, '天台德韶'],
  ['香林澄远', 908, 987, 80, '云门文偃'],
  ['云居道齐', 910, 974, 65, '清凉泰钦'],
  ['同安观志', 910, 970, 61, '同安道丕'],
  ['梁山缘观', 920, 990, 71, '同安观志'],
  ['五祖师戒', 920, 990, 71, '双泉师宽'],
  ['报慈德韶', '<950', 0, 0, '资福如宝'],
  ['三角志谦', 0, '>935', 0, '报慈德韶'],
  ['兴阳词铎', 925, 995, 71, '三角志谦'],
  ['首山省念', 926, 993, 68, '风穴延沼'],
  ['智门光祚', 928, 998, 71, '香林澄远'],
  ['清凉泰钦', 929, 997, 69, '法眼文益', ['法灯']],
  ['汾阳善昭', 945, 1023, 79, '首山省念', ['无德']],
  ['琅琊慧觉', 0, 0, 0, '汾阳善昭', ['广觉']],
  ['大阳警玄', 948, 1027, 80, '梁山缘观'],
  ['广慧元琏', 951, 1036, 86, '首山省念'],
  ['谷隐蕴聪', 965, 1032, 68, '首山省念', ['石门慈照']],
  ['杨亿居士', 974, 1020, 47, '广慧元琏'],
  ['灵隐文胜', 980, 1040, 61, '云居道齐'],
  ['雪窦重显', 980, 1052, 73, '智门光祚', ['明觉']],
  ['石霜楚圆', 987, 1040, 54, '汾阳善昭', ['慈明']],
  ['叶县归省', '<973', '>1000', 0, '首山省念'],
  ['浮山法远', 990, 1067, 78, '叶县归省', ['圆鉴']],
  ['天衣义怀', 993, 1064, 72, '雪窦重显'],
  ['开元智孜', 0, 0, 0, '天衣义怀'],
  ['神鼎洪諲', 994, 1038, 45, '首山省念'],
  ['杨岐方会', 996, 1049, 54, '石霜楚圆', ['杨岐派']],
  ['大愚守芝', '<999', '>1010', 0, '汾阳善昭'],
  ['云峰文悦', 998, 1062, 65, '大愚守芝'],
  ['黄龙慧南', 1002, 1069, 68, '石霜楚圆', ['黄龙派']],
  ['泐潭怀澄', '<980', '>1020', 0, '五祖师戒'],
  ['延庆子荣', '<985', '>1020', 0, '智门光祚'],
  ['大觉怀琏', 1009, 1091, 83, '泐潭怀澄'],
  ['圆通居讷', 1010, 1071, 62, '延庆子荣'],
  ['净因道臻', 1014, 1093, 80, '浮山法远', ['净照']],
  ['慧林宗本', 1020, 1099, 80, '天衣义怀', ['圆照']],
  ['白云守端', 1024, 1072, 49, '杨岐方会'],
  ['五祖法演', 1024, 1104, 81, '白云守端'],
  ['云庵真净', 1025, 1102, 78, '黄龙慧南', ['真净克文', '宝峰文']],
  ['晦堂祖心', 1025, 1100, 76, '黄龙慧南'],
  ['常总照觉', 1025, 1091, 67, '黄龙慧南'],
  ['法云法秀', 1027, 1090, 64, '天衣义怀', ['圆通']],
  ['投子义青', 1032, 1083, 52, '大阳警玄'],
  ['佛印了元', 1032, 1098, 67, '开元智孜'],
  ['法云善本', 1035, 1109, 75, '慧林宗本', ['大通']],
  ['苏东坡', 1037, 1101, 65, '常总照觉'],
  ['灵源惟清', 1040, 1117, 78, '晦堂祖心'],
  ['芙蓉道楷', 1043, 1118, 76, '投子义青'],
  ['张商英', 1043, 1121, 79, '兜率从悦'],
  ['兜率从悦', 1044, 1091, 48, '云庵真净'],
  ['开福道宁', 1053, 1113, 61, '五祖法演'],
  ['净因自觉', '<1080', 1117, 0, '芙蓉道楷'],
  ['文殊心道', 1058, 1129, 72, '太平慧勤'],
  ['大洪报恩', 1058, 1111, 54, '投子义青'],
  ['太平慧勤', 1059, 1117, 59, '五祖法演', ['佛鉴']],
  ['圆悟克勤', 1063, 1135, 73, '五祖法演', ['佛果']],
  ['丹霞子淳', 1064, 1117, 54, '芙蓉道楷'],
  ['龙门清远', 1067, 1120, 54, '五祖法演', ['佛眼']],
  ['妙湛思慧', 1071, 1145, 75, '法云善本'],
  ['枯木法成', 1071, 1128, 58, '芙蓉道楷', ['普证']],
  ['高庵善悟', 1074, 1132, 59, '龙门清远'],
  ['虎丘绍隆', 1077, 1136, 60, '圆悟克勤', ['虎丘派']],
  ['长芦崇信', '<1079', '>1095', 0, '慧林宗本', ['净照']],
  ['慧林怀深', 1077, 1132, 56, '长芦崇信', ['慈受']],
  ['大沩善果', 1079, 1152, 74, '开福道宁', ['月庵果']],
  ['云居法如', 1080, 1146, 67, '龙门清远'],
  ['青州希辨', 1081, 1149, 69, '净因自觉'],
  ['龙翔士珪', 1083, 1146, 64, '龙门清远', ['竹庵']],
  ['牧庵法忠', 1084, 1149, 66, '龙门清远'],
  ['雪窦嗣宗', 1085, 1153, 69, '宏智正觉'],
  ['大慧宗杲', 1089, 1163, 75, '圆悟克勤', ['佛日', '径山派']],
  ['月堂道昌', 1089, 1171, 83, '妙湛思慧'],
  ['净慈慧晖', 1090, 1159, 70, '宏智正觉', ['自得']],
  ['真歇清了', 1090, 1151, 62, '丹霞子淳'],
  ['大休宗钰', 1090, 1160, 71, '真歇清了'],
  ['宏智正觉', 1091, 1157, 67, '丹霞子淳'],
  ['应庵昙华', 1103, 1163, 61, '虎丘绍隆'],
  ['瞎堂慧远', 1103, 1176, 74, '圆悟克勤', ['佛海']],
  ['净因惟岳', '<1079', '>1120', 0, '慧林宗本', ['佛日']],
  ['灵隐慧光', '<1145', '>1125', 0, '慧林怀深'],
  ['广慧通理', 1104, 1175, 72, '净因惟岳'],
  ['雪窦智鉴', 1105, 1192, 88, '大休宗钰', ['足庵']],
  ['中竺元妙', 1111, 1164, 54, '灵隐慧光'],
  ['己庵深净', 0, 0, 0, '中竺元妙'],
  ['大明僧宝', 1114, 1173, 60, '青州希辨', ['大明法宝']],
  ['普庵印肃', 1116, 1169, 54, '牧庵法忠'],
  ['密庵咸杰', 1118, 1186, 69, '应庵昙华'],
  ['玉林师体', 1121, 1173, 53, '大明僧宝', ['王山觉体']],
  ['胜默圆光', 0, 0, 0, '玉林师体'],
  ['拙庵德光', 1121, 1203, 83, '大慧宗杲', ['佛照']],
  ['灵隐道济', 1130, 1209, 80, '瞎堂慧远', ['济公']],
  ['松源崇岳', 1132, 1202, 71, '密庵咸杰', ['松源派']],
  ['雪岩慧满', 1136, 1206, 71, '玉林师体'],
  ['破庵祖先', 1136, 1211, 76, '密庵咸杰', ['破庵派']],
  ['无用净全', 1137, 1207, 71, '大慧宗杲'],
  ['大洪祖证', '<1165', '>1155', 0, '大沩善果', ['老衲祖证']],
  ['月林师观', 1143, 1217, 75, '大洪祖证'],
  ['灵隐之善', 1152, 1235, 84, '拙庵德光'],
  ['天童如净', 1163, 1228, 66, '雪窦智鉴'],
  ['万松行秀', 1166, 1246, 81, '雪岩慧满'],
  ['天目文礼', 1167, 1250, 84, '松源崇岳', ['天童灭翁']],
  ['无准师范', 1179, 1249, 71, '破庵祖先', ['佛鉴']],
  ['无门慧开', 1183, 1260, 78, '月林师观', ['佛眼']],
  ['竹岩妙印', 1187, 1255, 69, '月林师观'],
  ['永平道元', 1200, 1253, 54, '天童如净'],
  ['断桥妙伦', 1201, 1261, 61, '无准师范'],
  ['海云印简', 1202, 1257, 56, '…五祖法演', ['佛日圆明']],
  ['雪庭福裕', 1203, 1275, 73, '万松行秀'],
  ['雪岩祖钦', 1215, 1287, 73, '无准师范'],
  ['鹿门觉', 1220, 1275, 56, '天童如净'],
  ['横川如珙', 1222, 1289, 68, '天目文礼'],
  ['少室文泰', 1229, 1289, 61, '雪庭福裕'],
  ['高峰原妙', 1238, 1295, 58, '雪岩祖钦'],
  ['铁牛持定', 1240, 1302, 63, '雪岩祖钦'],
  ['明极慧祚', '<1170', 0, 0, '净慈慧晖'],
  ['东谷妙光', 0, '>1255', 0, '明极慧祚', ['晦岩佛光']],
  ['直翁德举', 1242, 1324, 83, '东谷妙光'],
  ['还源福遇', 1245, 1313, 69, '少室文泰'],
  ['方山文宝', 1255, 1335, 81, '断桥妙伦', ['慧宝']],
  ['古林清茂', 1261, 1329, 69, '横川如珙'],
  ['断崖了义', 1263, 1335, 73, '高峰原妙'],
  ['中峰明本', 1263, 1323, 61, '高峰原妙'],
  ['无见先睹', 1265, 1334, 70, '方山文宝'],
  ['云外云岫', 1272, 1340, 69, '直翁德举'],
  ['淳拙文才', 1273, 1352, 80, '还源福遇'],
  ['元叟行端', 1274, 1341, 68, '…灵隐之善'],
  ['天如惟则', 1280, 1354, 75, '中峰明本'],
  ['千岩元长', 1284, 1357, 74, '中峰明本'],
  ['楚石梵琦', 1296, 1370, 75, '元叟行端'],
  ['无印大证', 1297, 1361, 65, '云外云岫'],
  ['万峰时蔚', 1303, 1381, 79, '千岩元长'],
  ['白云空度', 1304, 1370, 67, '无见先睹', ['无闻智度']],
  ['松庭子俨', 1309, 1382, 74, '淳拙文才'],
  ['凝然了改', 1333, 1420, 88, '松庭子俨'],
  ['海舟普慈', 1355, 1450, 96, '东明慧旵'],
  ['宝藏普持', '<1370', 1408, 0, '万峰时蔚'],
  ['东明慧旵', 1371, 1441, 71, '宝藏普持'],
  ['俱空契斌', 1383, 1452, 70, '凝然了改'],
  ['海舟永慈', 1399, 1461, 63, '东明慧旵'],
  ['古拙原俊', '<1360', '>1395', 0, '白云空度'],
  ['无际明悟', 1385, 1446, 62, '古拙原俊'],
  ['宝峰明瑄', 1401, 1472, 72, '海舟普慈'],
  ['楚山绍琦', 1405, 1470, 66, '无际明悟'],
  ['宝峰智瑄', '<1450', 1472, 0, '海舟永慈'],
  ['无方可从', 1420, 1482, 63, '俱空契斌'],
  ['天奇本瑞', 1433, 1513, 81, '宝峰明瑄'],
  ['月舟文载', 1454, 1523, 70, '无方可从'],
  ['无闻明聪', 1480, 1543, 64, '天奇本瑞', ['绝学正聪']],
  ['天宁道济', 1487, 1560, 74, '…无际明悟', ['法舟道济']],
  ['小山宗书', 1500, 1567, 68, '月舟文载'],
  ['云谷法会', 1500, 1575, 76, '天宁道济'],
  ['慈舟方念', 1510, 1594, 85, '幻休常润'],
  ['笑岩德宝', 1512, 1581, 70, '无闻明聪'],
  ['蕴空常忠', 1514, 1588, 75, '小山宗书'],
  ['幻休常润', 1514, 1585, 72, '小山宗书'],
  ['袁黄了凡', 1533, 1606, 74, '云谷法会'],
  ['紫柏真可', 1543, 1603, 61, '…无际明悟'],
  ['憨山德清', 1546, 1623, 78, '云谷法会'],
  ['无言正道', 1547, 1623, 77, '幻休常润'],
  ['无明慧经', 1548, 1618, 71, '蕴空常忠', ['寿昌系']],
  ['幻有正传', 1549, 1614, 66, '笑岩德宝', ['龙池系']],
  ['洪断诸缘', 1550, 1621, 72, '幻休常润'],
  ['朗目本智', 1555, 1605, 51, '…楚山绍琦', ['朗目派']],
  ['湛然圆澄', 1561, 1626, 66, '慈舟方念', ['云门系']],
  ['密云圆悟', 1566, 1642, 77, '幻有正传', ['天童系']],
  ['雪峤圆信', 1571, 1647, 77, '幻有正传'],
  ['汉月法藏', 1573, 1635, 63, '密云圆悟'],
  ['天隐圆修', 1575, 1635, 61, '幻有正传', ['磐山系']],
  ['永觉元贤', 1578, 1657, 80, '无明慧经'],
  ['晦台元镜', 1578, 1631, 54, '无明慧经'],
  ['无异元来', 1579, 1630, 52, '无明慧经'],
  ['瑞白明雪', 1583, 1641, 59, '湛然圆澄'],
  ['隐元隆琦', 1592, 1673, 82, '费隐通容'],
  ['觉浪道盛', 1592, 1659, 68, '晦台元镜'],
  ['费隐通容', 1593, 1661, 69, '密云圆悟'],
  ['林野通奇', 1595, 1652, 58, '密云圆悟'],
  ['破山海明', 1597, 1666, 70, '密云圆悟'],
  ['宗宝道独', 1600, 1661, 62, '无异元来'],
  ['破暗净灯', 1603, 1659, 57, '瑞白明雪'],
  ['䒢溪行森', 1603, 1667, 65, '玉林通琇'],
  ['箬庵通问', 1604, 1655, 52, '天隐圆修'],
  ['铁舟行海', 1608, 1683, 76, '箬庵通问'],
  ['玉林通琇', 1614, 1675, 62, '天隐圆修', ['玉琳国师', '大觉普济']],
  ['为霖道霈', 1615, 1702, 88, '永觉元贤'],
  ['主峰德昆', 1616, 1678, 63, '…瑞白明雪'],
  ['行山超宝', 1635, 1709, 75, '䒢溪行森'],
  ['古樵智先', 1635, 1705, 71, '破暗净灯'],
  ['楚云明慧', 1666, 1735, 70, '行山超宝'],
  ['德俊自觉', 1679, 1763, 85, '古樵智先'],
  ['大晓实彻', 1685, 1757, 73, '…铁舟行海'],
  ['天慧实彻', '<1713', 1745, 0, '…玉林通琇'],
  ['了凡际圣', 1700, 1756, 57, '天慧实彻'],
  ['临济未知', 0, 0, 0, '…临济义玄'],
  ['曹洞未知', 0, 0, 0, '…洞山良价'],
  ['云门未知', 0, 0, 0, '…云门文偃'],
  ['沩仰未知', 0, 0, 0, '…沩山灵祐'],
  ['牛头未知', 0, 0, 0, '…牛头法融'],
  ['峨嵋性天', 0, 0, 0, '临济未知'],
  ['庐山大安', 0, 0, 0, '临济未知'],
  ['大迁圆慧', 1509, 1594, 86, '峨嵋性天', ['国师']],
  ['大安明启', '<1560', '>1607', 77, '大迁圆慧'],
  ['无念深有', 1544, 1627, 84, '庐山大安', ['黄檗无念', '西影']]
]
  .map((p, i) => {
  const temples = personTemples[p[0]] || []
  const coordinates = {}
  // if (temples.length < 1) console.error(p[0])
  const templesFull = temples.map((t, i) => {
    const m1 = /\(.+$/.exec(t)
    const s = templeMap[t.replace(templeRe, '')]
    const m2 = s && /\s*@(\d.+)$/.exec(s)

    if (m2) {
      coordinates[i] = m2[1]
    } else {
      // console.log(t)
    }
    if (s) {
      return (s.replace(/\s*@\d.+$/, '') + (m1 ? m1[0] : ''))
        .replace(/\(.+\(/, '(')
    }
    return t
  })
  return {
    id: `${i + 1}`, name: p[0], parent: p[4],
    born: p[1], dead: p[2], age: p[3],
    alias: p[5] || [],
    temples: temples.map(t => t.replace(/\(.+$/, '')),
    templesFull: templesFull,
    coordinates: coordinates
  }
})

Object.keys(personTemples).forEach(k => console.assert(patriarchs.filter(p => p.name === k)[0], k))

const dynastyList = `东晋,317,419
南北朝,420,501
南梁,502,557
南陈,558,588
隋,589,617
初唐,618,712
盛唐,713,766
中唐,767,835
晚唐,836,907
五代,908,960
北宋太祖,961,976
北宋太宗,977,997
北宋真宗,998,1022
北宋仁宗,1023,1062
北宋英宗,1063,1067
北宋神宗,1068,1084
北宋哲宗,1085,1100
北宋徽宗,1101,1124
北宋末,1125,1126
南宋高宗,1127,1161
南宋孝宗,1162,1188
南宋光宗,1189,1194
南宋宁宗,1195,1224
南宋理宗,1225,1263
南宋度宗,1264,1273
南宋末,1274,1278
金,1125,1230
元,1271,1367
明前期,1368,1435
明中期,1436,1566
明晚期,1567,1644
清前期,1645,1735
清中期,1736,1839
晚清,1840,1911
民国,1912,1949`
.split('\n').map(s => s.split(','))
  .map(s => [s[0], parseInt(s[1]), parseInt(s[2])])

function toDynasty(year, offset=0) {
  const y = year && parseInt(`${year}`.replace(/[?<>]/g, ''))
  const r = y ? (dynastyList.filter(d => d[1] <= y + offset && y + offset <= d[2])[0] || '')[0] : ''
  return r && typeof year === 'number' ? r : r + '?'
}
